docs/procedure.md


<a id="org0daaac5"></a>

### Step 8: Progress Tracking

-   Check off unit in Personal Todo List
-   Estimate remaining time
-   Proceed to next unit


<a id="org2909991"></a>

## 4.3 Integration Milestones


<a id="orgc967d76"></a>

### Milestone Tasks

1.  Run full test suite
2.  Test end-to-end workflows with realistic data
3.  Validate outputs match specifications
4.  Document any discovered limitations
5.  Update project documentation


<a id="orgfd2334c"></a>

# Phase 5: Quality Assurance and Finalization


<a id="orge9a2299"></a>

## 5.1 Final Integration Testing

-   Test complete pipeline with real project data
-   Validate all outputs match specification requirements
-   Perform edge case testing based on negative space map
-   Document any remaining limitations


<a id="org9e43004"></a>

## 5.2 Documentation Finalization

-   Complete README with installation and usage instructions
-   Document all known limitations and workarounds
-   Include examples with realistic data
-   Add references to theoretical background


<a id="org63f98ce"></a>

## 5.3 Repository Quality Standards


<a id="orgbbe39ff"></a>

### Quality Checklist

-   [ ] Comprehensive README
-   [ ] All dependencies documented
-   [ ] Complete test coverage
-   [ ] Clear licensing
-   [ ] Reproducible examples
-   [ ] Version tagging


<a id="orgdf5d951"></a>

# Workflow Timing Guidelines


<a id="org7f8d176"></a>

## Phase Distribution

-   **Phase 1 (Bootstrap)**: 1-2 days (~25% of project time)
    -   Goal clarification: 3-6 hours
    -   Negative space mapping: 6-10 hours

-   **Phase 2 (Specifications)**: 1.5-3 days (~40% of project time)
    -   Specification brainstorming: 6-12 hours
    -   Specification iteration: 6-12 hours

> **Critical Design Investment**: Phases 1-2 should consume **~67% of total project time** to ensure robust design foundation

-   **Phase 3 (Decomposition)**: 0.5-1 day (~15% of project time)
    -   Atomic unit decomposition: 3-6 hours
    -   Quality control: 1-2 hours

-   **Phase 4 (Development)**: 1-1.5 days (~15% of project time)
    -   Per-unit development: 10-20 minutes per unit
    -   Integration milestones: 30-60 minutes each

-   **Phase 5 (Finalization)**: 0.25-0.5 day (~5% of project time)
    -   Final testing and documentation: 2-4 hours


<a id="orgae9cb18"></a>

## Total Range

4.5-7.5 days


<a id="org44eaad2"></a>

## Key Insight

Heavy upfront design investment (67% of time) dramatically reduces debugging and rework time, making total development time shorter and more predictable.


<a id="org4fdab5b"></a>

# Success Criteria

A successful project completion includes:

-   [X] All units pass individual tests
-   [X] Complete pipeline processes realistic data successfully
-   [X] Code is readable and well-documented
-   [X] Repository follows research-grade standards
-   [X] No blocking errors in normal usage scenarios
-   [X] Author can explain every code component confidently
-   [X] Statistical outputs meet original specifications
-   [X] Tool addresses original problem statement


<a id="org7737aec"></a>

# Adaptation Guidelines


<a id="orgb559a85"></a>

## For simpler projects

-   Compress bootstrap phase (focus on data flow failures)
-   Reduce decomposition granularity
-   Streamline documentation requirements


<a id="orgff56b5c"></a>

## For more complex projects

-   Extend negative space mapping with additional failure scenarios
-   Add intermediate integration milestones
-   Consider prototype development before full specifications
-   Include performance testing at integration points


<a id="orgaaa0324"></a>

## Learning focus adjustments

-   Increase unit granularity for unfamiliar concepts
-   Add explicit concept-learning checkpoints
-   Include additional explanation prompts for complex algorithms

> This procedure provides a systematic, scalable approach to developing research-grade data science tools while maintaining learning objectives and minimizing debugging overhead through comprehensive upfront planning.


<a id="orgdeeb054"></a>

# Complete Human-LLM Workflow Summary

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Phase</th>
<th scope="col" class="org-left">Step</th>
<th scope="col" class="org-left">Human Input</th>
<th scope="col" class="org-left">Human Activity</th>
<th scope="col" class="org-left">LLM Input</th>
<th scope="col" class="org-left">LLM Output</th>
<th scope="col" class="org-left">Human Output</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1.1</td>
<td class="org-left">Goal Clarification</td>
<td class="org-left">Pen &amp; paper</td>
<td class="org-left">Handwrite, validate with colleague</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left">Intent Document</td>
</tr>

<tr>
<td class="org-right">1.2</td>
<td class="org-left">Negative Space</td>
<td class="org-left">Intent Document</td>
<td class="org-left">Answer questions, take notes</td>
<td class="org-left">Intent Document + context</td>
<td class="org-left">Socratic questions</td>
<td class="org-left">Failure mode notes</td>
</tr>

<tr>
<td class="org-right">1.2</td>
<td class="org-left">Final Consolidation</td>
<td class="org-left">All failure notes</td>
<td class="org-left">Create consolidated document</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left">Negative Space Map</td>
</tr>

<tr>
<td class="org-right">2.1</td>
<td class="org-left">Spec Brainstorming</td>
<td class="org-left">Intent + Negative Space + Reuse</td>
<td class="org-left">Answer design questions, document decisions</td>
<td class="org-left">Intent + Negative Space + Reuse</td>
<td class="org-left">Design exploration questions</td>
<td class="org-left">Draft specifications</td>
</tr>

<tr>
<td class="org-right">2.2</td>
<td class="org-left">Spec Iteration</td>
<td class="org-left">Draft specifications</td>
<td class="org-left">Deep reflection, optional LLM consultation</td>
<td class="org-left">Optional: specific design challenges</td>
<td class="org-left">Optional: design guidance</td>
<td class="org-left">Final specifications</td>
</tr>

<tr>
<td class="org-right">3.1</td>
<td class="org-left">Decomposition</td>
<td class="org-left">Final Specs + Code Repos</td>
<td class="org-left">Structure input, review output</td>
<td class="org-left">Specs + repos + requirements</td>
<td class="org-left">Prompt Guide + Todo List</td>
<td class="org-left">Quality-checked documents</td>
</tr>

<tr>
<td class="org-right">4.1-8</td>
<td class="org-left">Each Unit</td>
<td class="org-left">Prompt from Guide</td>
<td class="org-left">Execute 8-step workflow</td>
<td class="org-left">Individual prompts</td>
<td class="org-left">Code + explanations</td>
<td class="org-left">Working code units</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Finalization</td>
<td class="org-left">All outputs</td>
<td class="org-left">Final testing &amp; documentation</td>
<td class="org-left">None (or optional assistance)</td>
<td class="org-left">None (or assistance)</td>
<td class="org-left">Research-grade repository</td>
</tr>
</tbody>
</table>


<a id="org5578d4d"></a>

## Key Insight

The procedure alternates between deep human thinking (handwritten foundation, specification writing) and collaborative human-LLM work (Socratic questioning, code generation), ensuring both cognitive rigor and implementation efficiency.

